In [40]:
import pandas as pd
import numpy as np

### Reading the data into the notebook

In [41]:
df_ipl_auction = pd.read_csv("IPL IMB381IPL2013.csv")
df_ipl_auction.head()

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [42]:
type(df_ipl_auction)

pandas.core.frame.DataFrame

### Finding the summary of the dataframe

In [43]:
df_ipl_auction.columns

Index(['Sl.NO.', 'PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE',
       'T-RUNS', 'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL',
       'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C',
       'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE',
       'SOLD PRICE'],
      dtype='object')

If too many columns, then use 'tranpose'. It shows rows as columns and vice versa

In [44]:
# dimension of the df
df_ipl_auction.shape

(130, 26)

In [45]:
df_ipl_auction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 130 entries, 0 to 129
Data columns (total 26 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sl.NO.         130 non-null    int64
 1   PLAYER NAME    130 non-null    object
 2   AGE            130 non-null    int64
 3   COUNTRY        130 non-null    object
 4   TEAM           130 non-null    object
 5   PLAYING ROLE   130 non-null    object
 6   T-RUNS         130 non-null    int64
 7   T-WKTS         130 non-null    int64
 8   ODI-RUNS-S     130 non-null    int64
 9   ODI-SR-B       130 non-null    float64
 10  ODI-WKTS       130 non-null    int64
 11  ODI-SR-BL      130 non-null    float64
 12  CAPTAINCY EXP  130 non-null    int64
 13  RUNS-S         130 non-null    int64
 14  HS             130 non-null    int64
 15  AVE            130 non-null    float64
 16  SR-B           130 non-null    float64
 17  SIXERS         130 non-null    int64
 18  RUNS-C         130 non-null    int64
 19  WKTS           130 non-null    int64
 20  AVE-BL         130 non-null    float64
 21  ECON           130 non-null    float64
 22  SR-BL          130 non-null    float64
 23  AUCTION YEAR   130 non-null    int64
 24  BASE PRICE     130 non-null    int64
 25  SOLD PRICE     130 non-null    int64
dtypes: float64(7), int64(15), object(4)
memory usage: 26.5+ KB

### Slicing and Indexing

In [46]:
df_ipl_auction[0:5]

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,Allrounder,0,0,0,0.00,...,0.00,0,307,15,20.47,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,Bowler,214,18,657,71.41,...,0.00,0,29,0,0.00,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,Bowler,571,58,1269,80.62,...,121.01,5,1059,29,36.52,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,Bowler,284,31,241,84.56,...,76.32,0,1125,49,22.96,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,Batsman,63,0,79,45.93,...,120.71,28,0,0,0.00,0.00,0.00,2011,100000,800000

In [47]:
df_ipl_auction[-5:]

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,PLAYING ROLE,T-RUNS,T-WKTS,ODI-RUNS-S,ODI-SR-B,...,SR-B,SIXERS,RUNS-C,WKTS,AVE-BL,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
125,126,"Yadav, AS",2,IND,DC,Batsman,0,0,0,0.00,...,125.64,2,0,0,0.00,0.00,0.00,2010,50000,750000
126,127,Younis Khan,2,PAK,RR,Batsman,6398,7,6814,75.78,...,42.85,0,0,0,0.00,0.00,0.00,2008,225000,225000
127,128,Yuvraj Singh,2,IND,KXIP+,Batsman,1775,9,8051,87.58,...,131.88,67,569,23,24.74,7.02,21.13,2011,400000,1800000
128,129,Zaheer Khan,2,IND,MI+,Bowler,1114,288,790,73.55,...,91.67,1,1783,65,27.43,7.75,21.26,2008,200000,450000
129,130,"Zoysa, DNT",2,SL,DC,Bowler,288,64,343,95.81,...,122.22,0,99,2,49.50,9.00,33.00,2008,100000,110000

In [48]:
df_ipl_auction['AUCTION YEAR'][0:5]

0    2009
1    2008
2    2008
3    2011
4    2011
Name: AUCTION YEAR, dtype: int64

In [49]:
df_ipl_auction[['PLAYER NAME', 'AGE']][0:5]

    PLAYER NAME  AGE
0   Abdulla, YA    2
1  Abdur Razzak    2
2   Agarkar, AB    2
3     Ashwin, R    1
4  Badrinath, S    2

In [50]:
df_ipl_auction.iloc[4:9,1:4]

     PLAYER NAME  AGE COUNTRY
4   Badrinath, S    2     IND
5     Bailey, GJ    2     AUS
6      Balaji, L    2     IND
7  Bollinger, DE    2     AUS
8       Botha, J    2      SA

### Value Counts and Cross Tabulations

In [51]:
df_ipl_auction['COUNTRY'].value_counts()

COUNTRY
IND    53
AUS    22
SA     16
SL     12
PAK     9
NZ      7
WI      6
ENG     3
BAN     1
ZIM     1
Name: count, dtype: int64

In [52]:
df_ipl_auction['COUNTRY'].value_counts(normalize=True)*100

COUNTRY
IND    40.769231
AUS    16.923077
SA     12.307692
SL      9.230769
PAK     6.923077
NZ      5.384615
WI      4.615385
ENG     2.307692
BAN     0.769231
ZIM     0.769231
Name: proportion, dtype: float64

In [53]:
pd.crosstab(df_ipl_auction['AGE'], df_ipl_auction['PLAYING ROLE'])

PLAYING ROLE  Allrounder  Batsman  Bowler  W. Keeper
AGE
1                      4        5       7          0
2                     25       21      29         11
3                      6       13       8          1

### Sorting df by column values

In [54]:
df_ipl_auction[['PLAYER NAME','SOLD PRICE']].sort_values(by='SOLD PRICE').head()

       PLAYER NAME  SOLD PRICE
73      Noffke, AA       20000
46     Kamran Khan       24000
0      Abdulla, YA       50000
1     Abdur Razzak       50000
118  Van der Merwe       50000

In [55]:
df_ipl_auction[['PLAYER NAME','SOLD PRICE']].sort_values(by='SOLD PRICE', ascending=False).head()

       PLAYER NAME  SOLD PRICE
93       Sehwag, V     1800000
127   Yuvraj Singh     1800000
50        Kohli, V     1800000
111  Tendulkar, SR     1800000
113     Tiwary, SS     1600000

### Creating new columns

In [56]:
df_ipl_auction.columns

Index(['Sl.NO.', 'PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE',
       'T-RUNS', 'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL',
       'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C',
       'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE',
       'SOLD PRICE'],
      dtype='object')

In [57]:
df_ipl_auction['Premium'] = df_ipl_auction['SOLD PRICE'] - df_ipl_auction['BASE PRICE']

In [58]:
df_ipl_auction[['Premium', 'PLAYER NAME']].head()

   Premium   PLAYER NAME
0        0   Abdulla, YA
1        0  Abdur Razzak
2   150000   Agarkar, AB
3   750000     Ashwin, R
4   700000  Badrinath, S

In [59]:
df_ipl_auction[['PLAYER NAME','BASE PRICE','SOLD PRICE','Premium']].sort_values(by='Premium').head()

        PLAYER NAME  BASE PRICE  SOLD PRICE  Premium
0       Abdulla, YA       50000       50000        0
40        Jaffer, W      150000      150000        0
45     Kamran Akmal      150000      150000        0
49       Katich, SM      200000      200000        0
58  Mascarenhas, AD      100000      100000        0

In [60]:
df_ipl_auction[['PLAYER NAME','BASE PRICE','SOLD PRICE','Premium']].sort_values(by='Premium', ascending=False).head()

       PLAYER NAME  BASE PRICE  SOLD PRICE  Premium
50        Kohli, V      150000     1800000  1650000
113     Tiwary, SS      100000     1600000  1500000
127   Yuvraj Singh      400000     1800000  1400000
111  Tendulkar, SR      400000     1800000  1400000
93       Sehwag, V      400000     1800000  1400000

### Grouping and Aggregating

In [61]:
df_ipl_auction.columns

Index(['Sl.NO.', 'PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE',
       'T-RUNS', 'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL',
       'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C',
       'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE',
       'SOLD PRICE', 'Premium'],
      dtype='object')

In [63]:
# avg sold price for each age category
df_ipl_auction.groupby(by='AGE')['SOLD PRICE'].mean().reset_index()

   AGE     SOLD PRICE
0    1  720250.000000
1    2  484534.883721
2    3  520178.571429

In [66]:
# avg sold price for each age and playing role
df_ipl_auction.groupby(by=['AGE','PLAYING ROLE'])['SOLD PRICE'].mean().reset_index()

    AGE PLAYING ROLE    SOLD PRICE
0     1   Allrounder  5.875000e+05
1     1      Batsman  1.110000e+06
2     1       Bowler  5.177143e+05
3     2   Allrounder  4.494000e+05
4     2      Batsman  6.547619e+05
5     2       Bowler  3.979310e+05
6     2    W. Keeper  4.677273e+05
7     3   Allrounder  7.666667e+05
8     3      Batsman  4.576923e+05
9     3       Bowler  4.143750e+05
10    3    W. Keeper  7.000000e+05

### Joining Dataframes

In [68]:
sold_price_by_age_role = df_ipl_auction.groupby(by=['AGE','PLAYING ROLE'])['SOLD PRICE'].mean().reset_index()
print(sold_price_by_age_role)

    AGE PLAYING ROLE    SOLD PRICE
0     1   Allrounder  5.875000e+05
1     1      Batsman  1.110000e+06
2     1       Bowler  5.177143e+05
3     2   Allrounder  4.494000e+05
4     2      Batsman  6.547619e+05
5     2       Bowler  3.979310e+05
6     2    W. Keeper  4.677273e+05
7     3   Allrounder  7.666667e+05
8     3      Batsman  4.576923e+05
9     3       Bowler  4.143750e+05
10    3    W. Keeper  7.000000e+05

In [69]:
sold_price_by_age = df_ipl_auction.groupby(by=['AGE','PLAYING ROLE'])['SOLD PRICE'].mean().reset_index()
print(sold_price_by_age)

    AGE PLAYING ROLE    SOLD PRICE
0     1   Allrounder  5.875000e+05
1     1      Batsman  1.110000e+06
2     1       Bowler  5.177143e+05
3     2   Allrounder  4.494000e+05
4     2      Batsman  6.547619e+05
5     2       Bowler  3.979310e+05
6     2    W. Keeper  4.677273e+05
7     3   Allrounder  7.666667e+05
8     3      Batsman  4.576923e+05
9     3       Bowler  4.143750e+05
10    3    W. Keeper  7.000000e+05

In [71]:
soldprice_comparison = sold_price_by_age_role.merge(sold_price_by_age, on='AGE',how='outer')
soldprice_comparison

    AGE PLAYING ROLE_x  SOLD PRICE_x PLAYING ROLE_y  SOLD PRICE_y
0     1     Allrounder  5.875000e+05     Allrounder  5.875000e+05
1     1     Allrounder  5.875000e+05        Batsman  1.110000e+06
2     1     Allrounder  5.875000e+05         Bowler  5.177143e+05
3     1        Batsman  1.110000e+06     Allrounder  5.875000e+05
4     1        Batsman  1.110000e+06        Batsman  1.110000e+06
5     1        Batsman  1.110000e+06         Bowler  5.177143e+05
6     1         Bowler  5.177143e+05     Allrounder  5.875000e+05
7     1         Bowler  5.177143e+05        Batsman  1.110000e+06
8     1         Bowler  5.177143e+05         Bowler  5.177143e+05
9     2     Allrounder  4.494000e+05     Allrounder  4.494000e+05
10    2     Allrounder  4.494000e+05        Batsman  6.547619e+05
11    2     Allrounder  4.494000e+05         Bowler  3.979310e+05
12    2     Allrounder  4.494000e+05      W. Keeper  4.677273e+05
13    2        Batsman  6.547619e+05     Allrounder  4.494000e+05
14    2        Batsman  6.547619e+05        Batsman  6.547619e+05
15    2        Batsman  6.547619e+05         Bowler  3.979310e+05
16    2        Batsman  6.547619e+05      W. Keeper  4.677273e+05
17    2         Bowler  3.979310e+05     Allrounder  4.494000e+05
18    2         Bowler  3.979310e+05        Batsman  6.547619e+05
19    2         Bowler  3.979310e+05         Bowler  3.979310e+05
20    2         Bowler  3.979310e+05      W. Keeper  4.677273e+05
21    2      W. Keeper  4.677273e+05     Allrounder  4.494000e+05
22    2      W. Keeper  4.677273e+05        Batsman  6.547619e+05
23    2      W. Keeper  4.677273e+05         Bowler  3.979310e+05
24    2      W. Keeper  4.677273e+05      W. Keeper  4.677273e+05
25    3     Allrounder  7.666667e+05     Allrounder  7.666667e+05
26    3     Allrounder  7.666667e+05        Batsman  4.576923e+05
27    3     Allrounder  7.666667e+05         Bowler  4.143750e+05
28    3     Allrounder  7.666667e+05      W. Keeper  7.000000e+05
29    3        Batsman  4.576923e+05     Allrounder  7.666667e+05
30    3        Batsman  4.576923e+05        Batsman  4.576923e+05
31    3        Batsman  4.576923e+05         Bowler  4.143750e+05
32    3        Batsman  4.576923e+05      W. Keeper  7.000000e+05
33    3         Bowler  4.143750e+05     Allrounder  7.666667e+05
34    3         Bowler  4.143750e+05        Batsman  4.576923e+05
35    3         Bowler  4.143750e+05         Bowler  4.143750e+05
36    3         Bowler  4.143750e+05      W. Keeper  7.000000e+05
37    3      W. Keeper  7.000000e+05     Allrounder  7.666667e+05
38    3      W. Keeper  7.000000e+05        Batsman  4.576923e+05
39    3      W. Keeper  7.000000e+05         Bowler  4.143750e+05
40    3      W. Keeper  7.000000e+05      W. Keeper  7.000000e+05

### Renaming Columns

In [72]:
soldprice_comparison.rename(columns={'SOLD PRICE_x':'SOLD_PRICE_AGE_ROLE','SOLD PRICE_y':'SOLD_PRICE_AGE'}, inplace=True)

In [73]:
soldprice_comparison.head()

   AGE PLAYING ROLE_x  SOLD_PRICE_AGE_ROLE PLAYING ROLE_y  SOLD_PRICE_AGE
0    1     Allrounder             587500.0     Allrounder    5.875000e+05
1    1     Allrounder             587500.0        Batsman    1.110000e+06
2    1     Allrounder             587500.0         Bowler    5.177143e+05
3    1        Batsman            1110000.0     Allrounder    5.875000e+05
4    1        Batsman            1110000.0        Batsman    1.110000e+06

### Applying operations to Multiple Columns

In [74]:
soldprice_comparison['change'] = soldprice_comparison.apply(
    lambda rec:(rec.SOLD_PRICE_AGE_ROLE - rec.SOLD_PRICE_AGE)/rec.SOLD_PRICE_AGE, axis=1
)

In [75]:
soldprice_comparison

,AGE,PLAYING ROLE_x,SOLD_PRICE_AGE_ROLE,PLAYING ROLE_y,SOLD_PRICE_AGE,change
0,1,Allrounder,5.875000e+05,Allrounder,5.875000e+05,0.000000
1,1,Allrounder,5.875000e+05,Batsman,1.110000e+06,-0.470721
2,1,Allrounder,5.875000e+05,Bowler,5.177143e+05,0.134796
3,1,Batsman,1.110000e+06,Allrounder,5.875000e+05,0.889362
4,1,Batsman,1.110000e+06,Batsman,1.110000e+06,0.000000
5,1,Batsman,1.110000e+06,Bowler,5.177143e+05,1.144040
6,1,Bowler,5.177143e+05,Allrounder,5.875000e+05,-0.118784
7,1,Bowler,5.177143e+05,Batsman,1.110000e+06,-0.533591
8,1,Bowler,5.177143e+05,Bowler,5.177143e+05,0.000000
9,2,Allrounder,4.494000e+05,Allrounder,4.494000e+05,0.000000
10,2,Allrounder,4.494000e+05,Batsman,6.547619e+05,-0.313644
11,2,Allrounder,4.494000e+05,Bowler,3.979310e+05,0.129341
12,2,Allrounder,4.494000e+05,W. Keeper,4.677273e+05,-0.039184
13,2,Batsman,6.547619e+05,Allrounder,4.494000e+05,0.456969
14,2,Batsman,6.547619e+05,Batsman,6.547619e+05,0.000000
15,2,Batsman,6.547619e+05,Bowler,3.979310e+05,0.645416
16,2,Batsman,6.547619e+05,W. Keeper,4.677273e+05,0.399880
17,2,Bowler,3.979310e+05,Allrounder,4.494000e+05,-0.114528
18,2,Bowler,3.979310e+05,Batsman,6.547619e+05,-0.392251
19,2,Bowler,3.979310e+05,Bowler,3.979310e+05,0.000000
20,2,Bowler,3.979310e+05,W. Keeper,4.677273e+05,-0.149224
21,2,W. Keeper,4.677273e+05,Allrounder,4.494000e+05,0.040782
22,2,W. Keeper,4.677273e+05,Batsman,6.547619e+05,-0.285653
23,2,W. Keeper,4.677273e+05,Bowler,3.979310e+05,0.175398
24,2,W. Keeper,4.677273e+05,W. Keeper,4.677273e+05,0.000000
25,3,Allrounder,7.666667e+05,Allrounder,7.666667e+05,0.000000
26,3,Allrounder,7.666667e+05,Batsman,4.576923e+05,0.675070
27,3,Allrounder,7.666667e+05,Bowler,4.143750e+05,0.850176
28,3,Allrounder,7.666667e+05,W. Keeper,7.000000e+05,0.095238
29,3,Batsman,4.576923e+05,Allrounder,7.666667e+05,-0.403010
30,3,Batsman,4.576923e+05,Batsman,4.576923e+05,0.000000
31,3,Batsman,4.576923e+05,Bowler,4.143750e+05,0.104536
32,3,Batsman,4.576923e+05,W. Keeper,7.000000e+05,-0.346154
33,3,Bowler,4.143750e+05,Allrounder,7.666667e+05,-0.459511
34,3,Bowler,4.143750e+05,Batsman,4.576923e+05,-0.094643
35,3,Bowler,4.143750e+05,Bowler,4.143750e+05,0.000000
36,3,Bowler,4.143750e+05,W. Keeper,7.000000e+05,-0.408036
37,3,W. Keeper,7.000000e+05,Allrounder,7.666667e+05,-0.086957
38,3,W. Keeper,7.000000e+05,Batsman,4.576923e+05,0.529412
39,3,W. Keeper,7.000000e+05,Bowler,4.143750e+05,0.689291
40,3,W. Keeper,7.000000e+05,W. Keeper,7.000000e+05,0.000000

### Filtering records based on condition

In [79]:
df_ipl_auction[df_ipl_auction['SIXERS'] > 80]['PLAYER NAME']

26        Gayle, CH
28    Gilchrist, AC
82       Pathan, YK
88        Raina, SK
97       Sharma, RG
Name: PLAYER NAME, dtype: object

### Removing a column or a row from the dataset

In [81]:
df_ipl_auction.columns

Index(['Sl.NO.', 'PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE',
       'T-RUNS', 'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL',
       'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C',
       'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE',
       'SOLD PRICE', 'Premium'],
      dtype='object')

In [82]:
df_ipl_auction.drop('Sl.NO.',inplace=True, axis=1)

In [83]:
df_ipl_auction.columns

Index(['PLAYER NAME', 'AGE', 'COUNTRY', 'TEAM', 'PLAYING ROLE', 'T-RUNS',
       'T-WKTS', 'ODI-RUNS-S', 'ODI-SR-B', 'ODI-WKTS', 'ODI-SR-BL',
       'CAPTAINCY EXP', 'RUNS-S', 'HS', 'AVE', 'SR-B', 'SIXERS', 'RUNS-C',
       'WKTS', 'AVE-BL', 'ECON', 'SR-BL', 'AUCTION YEAR', 'BASE PRICE',
       'SOLD PRICE', 'Premium'],
      dtype='object')